In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('./students.csv')
df = pd.DataFrame(data)
df

   RollNo   Name  Maths  Science  English
0       1   Amit     78       85       80
1       2   Neha     90       88       92
2       3  Rahul     65       70       68
3       4  Priya     95       92       94
4       5  Karan     72       75       70

In [3]:
df.head()

   RollNo   Name  Maths  Science  English
0       1   Amit     78       85       80
1       2   Neha     90       88       92
2       3  Rahul     65       70       68
3       4  Priya     95       92       94
4       5  Karan     72       75       70

In [4]:
df.tail()

   RollNo   Name  Maths  Science  English
0       1   Amit     78       85       80
1       2   Neha     90       88       92
2       3  Rahul     65       70       68
3       4  Priya     95       92       94
4       5  Karan     72       75       70

In [5]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   RollNo   5 non-null      int64
 1   Name     5 non-null      str
 2   Maths    5 non-null      int64
 3   Science  5 non-null      int64
 4   English  5 non-null      int64
dtypes: int64(4), str(1)
memory usage: 332.0 bytes

In [6]:
df.describe()

         RollNo      Maths    Science    English
count  5.000000   5.000000   5.000000   5.000000
mean   3.000000  80.000000  82.000000  80.800000
std    1.581139  12.429803   9.192388  12.049896
min    1.000000  65.000000  70.000000  68.000000
25%    2.000000  72.000000  75.000000  70.000000
50%    3.000000  78.000000  85.000000  80.000000
75%    4.000000  90.000000  88.000000  92.000000
max    5.000000  95.000000  92.000000  94.000000

In [7]:
df["Total"] = df["Maths"] + df["Science"] + df["English"]
df

   RollNo   Name  Maths  Science  English  Total
0       1   Amit     78       85       80    243
1       2   Neha     90       88       92    270
2       3  Rahul     65       70       68    203
3       4  Priya     95       92       94    281
4       5  Karan     72       75       70    217

In [8]:
df["Average"] = df["Total"]/3
df

   RollNo   Name  Maths  Science  English  Total    Average
0       1   Amit     78       85       80    243  81.000000
1       2   Neha     90       88       92    270  90.000000
2       3  Rahul     65       70       68    203  67.666667
3       4  Priya     95       92       94    281  93.666667
4       5  Karan     72       75       70    217  72.333333

In [9]:
df["Result"] = df["Average"]>=75
df

   RollNo   Name  Maths  Science  English  Total    Average  Result
0       1   Amit     78       85       80    243  81.000000    True
1       2   Neha     90       88       92    270  90.000000    True
2       3  Rahul     65       70       68    203  67.666667   False
3       4  Priya     95       92       94    281  93.666667    True
4       5  Karan     72       75       70    217  72.333333   False

In [10]:
passed_students = df[df["Result"]]
passed_students

   RollNo   Name  Maths  Science  English  Total    Average  Result
0       1   Amit     78       85       80    243  81.000000    True
1       2   Neha     90       88       92    270  90.000000    True
3       4  Priya     95       92       94    281  93.666667    True

In [11]:
Maths_Topper = df[df["Maths"]>=90]
Maths_Topper

   RollNo   Name  Maths  Science  English  Total    Average  Result
1       2   Neha     90       88       92    270  90.000000    True
3       4  Priya     95       92       94    281  93.666667    True

In [12]:
df.sort_values(by="Average",ascending=False)

   RollNo   Name  Maths  Science  English  Total    Average  Result
3       4  Priya     95       92       94    281  93.666667    True
1       2   Neha     90       88       92    270  90.000000    True
0       1   Amit     78       85       80    243  81.000000    True
4       5  Karan     72       75       70    217  72.333333   False
2       3  Rahul     65       70       68    203  67.666667   False

In [13]:
df.to_csv('students_result.csv',index=False)

In [14]:
Results = pd.read_csv('./students_result.csv')
Results

   RollNo   Name  Maths  Science  English  Total    Average  Result
0       1   Amit     78       85       80    243  81.000000    True
1       2   Neha     90       88       92    270  90.000000    True
2       3  Rahul     65       70       68    203  67.666667   False
3       4  Priya     95       92       94    281  93.666667    True
4       5  Karan     72       75       70    217  72.333333   False